#ifndef STRATEGY_H
#define STRATEGY_H

/**
* @filename         Strategy.h
* @brief            策略模式
* @author           HXJ
* @date             2022-05-24
**/


//动机
    //在软件构建过程中，某些对象使用的算法可能多种多样，经常改变，如果将这些算法都编码到对象这，
    //将会使对象变得异常复杂；而且有时候支持不使用的算法也是一种性能负担
    //如何在运行时根据需要透明地更改对象的算法？将算法和对象本身解耦，从而避免上述问题？

//定义
    //定义一些列算法，把它们一个个封装起来，并且使它们可以互相替换（变化）。
    //该模式使得算法可以独立于使用它们的客户程序（稳定）而变化（扩展，子类话）

//总结
    //Strategy 及其子类为组件提供了一些列可重用的算法，从而使得类型在运行是方便地根据需要在各个算法间切换
    //Strategy模式提供了用条件判断语句以外的另一种选择，消除条件判断语句，就是在解耦合。含有许多条件判断语句的代码通常需要策略模式
    //如果Strategy对象没有实例变量，那么各个上下文可以共享同一个Strategy对象，从而节省对象开销。


#endif // STRATEGY_H














